* Programming a Guessing Game

First we generate the project

#+BEGIN_SRC sh
cargo new guessing_game
#+END_SRC

Then we look at the TOML file: 

#+BEGIN_SRC sh :results raw
cd guessing_game
cat Cargo.toml
#+END_SRC

#+RESULTS:
[package]
name = "guessing_game"
version = "0.1.0"
authors = ["dr-neptune <mrose4@worcester.edu>"]
edition = "2018"

# See more keys and their definitions at https://doc.rust-lang.org/cargo/reference/manifest.html

[dependencies]

#+BEGIN_SRC sh
cd guessing_game
cargo run
#+END_SRC

#+RESULTS:
| Hello | world! |

#+BEGIN_SRC rust
// bring the io library into scope
use std::io;

fn main() {
    // print to screen
    println!("Guess the number!");
    println!("Please input your guess.");
    // store user input in a mutable variable
    let mut guess = String::new();
    // call stdin from the io module
    io::stdin()
        // call the read_line method on the stdin to get input from the user.
        // read_line takes whatever the user types and places it into a string, so it takes a string as an argument.
        // & means that this argument is a reference, which lets multiple parts of our code access it without copying it into memory multiple times
        // returns a value: io::Result which is either Ok or Err
        .read_line(&mut guess)
        // if io::Result is an Err value, cause the program to crash. If Ok, then return value that Ok is holding.
        .expect("Failed to read line");
    // print the string that we saved user input in
    println!("You guessed: {}", guess);
}
#+END_SRC


#+BEGIN_SRC rust
fn main() {
    let x = 5;
    let y = 10;

    println!("x = {} and y = {}", x, y);
}
#+END_SRC

